<a href="https://colab.research.google.com/github/krishbhowmick/EDA/blob/main/EDA9_LondonHousingData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **What are the Python queries that you will use to get the below data points?**


Q1. Convert the data type of "Data" column to date-time format

Q2. Add a new column "Year" in the dataframe which contain only year.

Q3. Add a new column "Month" as 2nd column in the dataframe which contain month only.

Q4. Remove column Month and year from the dataframe.

Q5. Show all the records where "No. of records is 0" and how many such records are there.

Q6. What is the maximum & minimum number of "avg price" per year in England

Q7. What is the maximum & minimum number of "Crime Reported" as per area ?

Q8. Show the total count of records of each area where avg price is less then 100000 ?

In [4]:
# Connect the google drive with google Colab

from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

In [41]:
import pandas as pd 
df = pd.read_csv("/content/drive/MyDrive/DataAnalysis/5. London Housing Data.csv" )
df.head(5)

       date            area  ...  houses_sold no_of_crimes
0  1/1/1995  city of london  ...         17.0          NaN
1  2/1/1995  city of london  ...          7.0          NaN
2  3/1/1995  city of london  ...         14.0          NaN
3  4/1/1995  city of london  ...          7.0          NaN
4  5/1/1995  city of london  ...         10.0          NaN

[5 rows x 6 columns]

In [42]:
df.shape

(13549, 6)

In [43]:
df.index

RangeIndex(start=0, stop=13549, step=1)

In [44]:
df.columns

Index(['date', 'area', 'average_price', 'code', 'houses_sold', 'no_of_crimes'], dtype='object')

In [45]:
df.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

In [46]:
df.nunique()

date               301
area                45
average_price    13343
code                45
houses_sold       3946
no_of_crimes      2669
dtype: int64

In [47]:
df.count()

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13455
no_of_crimes      7439
dtype: int64

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           13549 non-null  object
 1   area           13549 non-null  object
 2   average_price  13549 non-null  int64
 3   code           13549 non-null  object
 4   houses_sold    13455 non-null  float64
 5   no_of_crimes   7439 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 635.2+ KB

In [49]:
df.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

# Q1. Convert the data type of "Data" column to date-time format

In [50]:
df.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

In [51]:
df.date = pd.to_datetime(df.date)

In [52]:
df.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

# Q2. Add a new column "Year" in the dataframe which contain only year.

In [53]:
df['Year'] =df.date.dt.year
#df['Month'] =df.date.dt.month
#df['Month_Name'] =df.date.dt.month_name
#df['Day'] =df.date.dt.day

In [54]:
df.head()

        date            area  average_price  ... houses_sold  no_of_crimes  Year
0 1995-01-01  city of london          91449  ...        17.0           NaN  1995
1 1995-02-01  city of london          82203  ...         7.0           NaN  1995
2 1995-03-01  city of london          79121  ...        14.0           NaN  1995
3 1995-04-01  city of london          77101  ...         7.0           NaN  1995
4 1995-05-01  city of london          84409  ...        10.0           NaN  1995

[5 rows x 7 columns]

# Q3. Add a new column "Month" as 2nd column in the dataframe which contain month only.

In [55]:
df.insert(1,'Month', df.date.dt.month)

In [56]:
df.head()

        date  Month            area  ...  houses_sold no_of_crimes  Year
0 1995-01-01      1  city of london  ...         17.0          NaN  1995
1 1995-02-01      2  city of london  ...          7.0          NaN  1995
2 1995-03-01      3  city of london  ...         14.0          NaN  1995
3 1995-04-01      4  city of london  ...          7.0          NaN  1995
4 1995-05-01      5  city of london  ...         10.0          NaN  1995

[5 rows x 8 columns]

# Q4. Remove column Month and year from the dataframe.

In [57]:
df.drop(['Month','Year'], axis=1)

            date            area  ...  houses_sold no_of_crimes
0     1995-01-01  city of london  ...         17.0          NaN
1     1995-02-01  city of london  ...          7.0          NaN
2     1995-03-01  city of london  ...         14.0          NaN
3     1995-04-01  city of london  ...          7.0          NaN
4     1995-05-01  city of london  ...         10.0          NaN
...          ...             ...  ...          ...          ...
13544 2019-09-01         england  ...      64605.0          NaN
13545 2019-10-01         england  ...      68677.0          NaN
13546 2019-11-01         england  ...      67814.0          NaN
13547 2019-12-01         england  ...          NaN          NaN
13548 2020-01-01         england  ...          NaN          NaN

[13549 rows x 6 columns]

# Q5. Show all the records where "No. of records is 0" and how many such records are there.

In [58]:
df[df['no_of_crimes']==0]

          date  Month            area  ...  houses_sold no_of_crimes  Year
72  2001-01-01      1  city of london  ...         24.0          0.0  2001
73  2001-02-01      2  city of london  ...         37.0          0.0  2001
74  2001-03-01      3  city of london  ...         44.0          0.0  2001
75  2001-04-01      4  city of london  ...         38.0          0.0  2001
76  2001-05-01      5  city of london  ...         30.0          0.0  2001
..         ...    ...             ...  ...          ...          ...   ...
178 2009-11-01     11  city of london  ...         11.0          0.0  2009
179 2009-12-01     12  city of london  ...         16.0          0.0  2009
180 2010-01-01      1  city of london  ...         20.0          0.0  2010
181 2010-02-01      2  city of london  ...          9.0          0.0  2010
182 2010-03-01      3  city of london  ...         15.0          0.0  2010

[104 rows x 8 columns]

In [59]:
len( df[df['no_of_crimes']==0] )

104

# Q6. What is the maximum & minimum number of "avg price" per year in England

In [60]:
df1= df[df.area == 'england']
df1

            date  Month     area  ...  houses_sold no_of_crimes  Year
13248 1995-01-01      1  england  ...      47639.0          NaN  1995
13249 1995-02-01      2  england  ...      47880.0          NaN  1995
13250 1995-03-01      3  england  ...      67025.0          NaN  1995
13251 1995-04-01      4  england  ...      56925.0          NaN  1995
13252 1995-05-01      5  england  ...      64192.0          NaN  1995
...          ...    ...      ...  ...          ...          ...   ...
13544 2019-09-01      9  england  ...      64605.0          NaN  2019
13545 2019-10-01     10  england  ...      68677.0          NaN  2019
13546 2019-11-01     11  england  ...      67814.0          NaN  2019
13547 2019-12-01     12  england  ...          NaN          NaN  2019
13548 2020-01-01      1  england  ...          NaN          NaN  2020

[301 rows x 8 columns]

In [61]:
df1.groupby('Year').average_price.max

In [62]:
df1.groupby('Year').average_price.min()

Year
1995     52788
1996     52333
1997     55789
1998     61659
1999     65522
2000     75219
2001     84245
2002     96215
2003    121610
2004    139719
2005    158572
2006    166544
2007    181824
2008    165795
2009    159340
2010    174458
2011    173046
2012    174161
2013    176816
2014    188265
2015    202856
2016    220361
2017    231593
2018    240428
2019    243281
2020    247355
Name: average_price, dtype: int64

# Q7. What is the maximum & minimum number of "Crime Reported" as per area ?

In [63]:
df.groupby('area').no_of_crimes.min().sort_values(ascending=False)

area
westminster               3504.0
lambeth                   2381.0
southwark                 2267.0
newham                    2130.0
camden                    2079.0
croydon                   2031.0
islington                 1871.0
ealing                    1871.0
hackney                   1870.0
brent                     1850.0
barnet                    1703.0
lewisham                  1675.0
tower hamlets             1646.0
enfield                   1635.0
wandsworth                1582.0
waltham forest            1575.0
haringey                  1536.0
hounslow                  1529.0
greenwich                 1513.0
redbridge                 1487.0
hillingdon                1445.0
bromley                   1441.0
kensington and chelsea    1347.0
hammersmith and fulham    1323.0
barking and dagenham      1217.0
havering                  1130.0
harrow                     937.0
bexley                     860.0
merton                     819.0
sutton                     787.0
richmond upon thames       700.0
kingston upon thames       692.0
city of london               0.0
east midlands                NaN
east of england              NaN
england                      NaN
inner london                 NaN
london                       NaN
north east                   NaN
north west                   NaN
outer london                 NaN
south east                   NaN
south west                   NaN
west midlands                NaN
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [64]:
df.groupby('area').no_of_crimes.max().sort_values(ascending=False)

area
westminster               7461.0
lambeth                   4701.0
camden                    4558.0
southwark                 3821.0
newham                    3668.0
hackney                   3466.0
ealing                    3401.0
islington                 3384.0
tower hamlets             3316.0
croydon                   3263.0
haringey                  3199.0
wandsworth                3051.0
waltham forest            2941.0
brent                     2937.0
barnet                    2893.0
greenwich                 2853.0
hillingdon                2819.0
hounslow                  2817.0
lewisham                  2813.0
enfield                   2798.0
kensington and chelsea    2778.0
hammersmith and fulham    2645.0
bromley                   2637.0
redbridge                 2560.0
barking and dagenham      2049.0
havering                  1956.0
bexley                    1914.0
harrow                    1763.0
merton                    1623.0
richmond upon thames      1551.0
sutton                    1425.0
kingston upon thames      1379.0
city of london              10.0
east midlands                NaN
east of england              NaN
england                      NaN
inner london                 NaN
london                       NaN
north east                   NaN
north west                   NaN
outer london                 NaN
south east                   NaN
south west                   NaN
west midlands                NaN
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

# Q8. Show the total count of records of each area where avg price is less then 100000 ?

In [65]:
df[ df['average_price'] <100000] .area.value_counts()

north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
sutton                   54
enfield                  54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
hounslow                 41
lambeth                  41
brent                    40
london                   39
merton                   35
bromley                  33
haringey                 33
ealing                   31
inner london             31
kingston upon thames     30
harrow                   30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: area, dtype: int64